TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ОчередьОбработкиВходящихСообщенийRMQ/гкс_ОчередьОбработкиВходящихСообщенийRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ОчередьОбработкиВходящихСообщенийRMQ</name>
  <dimensions>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>CatalogRef.гкс_ВходящиеСообщенияRMQ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПотокСобытий</name>
    <type>
      <types>CatalogRef.гкс_ПотокиСобытий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ВходящиеСообщенияRMQ/гкс_ВходящиеСообщенияRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ВходящиеСообщенияRMQ</name>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорневойИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаСобытияВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаИзмененияСобытияВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подписка</name>
    <type>
      <types>CatalogRef.ПодпискиНаОчередиСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержимое</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <comment>Дата получения сообщения и сохранения в ИБ</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияВОбработку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <comment>Дата последней обработки сообщения в очереди</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Хоп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСостав</name>
    <comment>Краткий состав загруженных объектов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗагруженныеОбъекты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ОчередьОбработкиВходящихСообщенийRMQ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает подготовленный запрос для получения очереди входящих сообщений.
//
// Параметры:
//  ПараметрыЗапроса - Структура - структура параметров запроса
//                   - Неопределено - запрос будет инициализирован значенями по умолчанию.
//
// Возвращаемое значение:
//  Запрос - 
//
Функция ЗапросСообщенияИзОчереди(Знач ПараметрыЗапроса = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		ТипСтруктура = Тип("Структура");
		гкс_ОбщегоНазначенияКлиентСервер
						      .ПроверитьПараметр(
						      "гкс_ОчередьОбработкиВходящихСообщенийRMQ.ЗапросСообщенияИзОчереди", 
						      "ПараметрыЗапроса",
						       ПараметрыЗапроса, 
						       ТипСтруктура);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаСообщенийОчереди(ПараметрыЗапроса);
	Запрос.Параметры.Вставить("ПотокСобытий");
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		ЗаполнитьЗначенияСвойств(Запрос.Параметры, ПараметрыЗапроса);
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

Функция ПотокСобытийСообщения(Знач Сообщение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сообщение", Сообщение);
	Запрос.Текст = ТекстЗапросаПотокСобытийСообщения();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПотокСобытий;
	КонецЕсли;
	
	Возврат Справочники.гкс_ПотокиСобытий.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗафиксироватьСообщениеВОчереди(Сообщение, 
                                         Знач КлючОбъекта = Неопределено, 
                                         Знач Порядок = Неопределено,
                                         Знач ПотокСобытий = Неопределено) Экспорт
		
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Сообщение", Сообщение);
	
	Если НЕ ЗначениеЗаполнено(Порядок) Тогда	
		Порядок = ТекущаяУниверсальнаяДатаВМиллисекундах();		
	КонецЕсли;
	СтруктураЗаписи.Вставить("Порядок", Порядок);
	
	Если ЗначениеЗаполнено(КлючОбъекта) Тогда		
		СтруктураЗаписи.Вставить("КлючОбъекта", КлючОбъекта);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПотокСобытий) Тогда		
		ПотокСобытий = Справочники.гкс_ПотокиСобытий.ОсновнойПотокПоУмолчанию();		
	КонецЕсли;
	СтруктураЗаписи.Вставить("ПотокСобытий", ПотокСобытий);
	
	гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "гкс_ОчередьОбработкиВходящихСообщенийRMQ");
	
КонецПроцедуры

Процедура ОтметитьОбработкуСообщенияВОчереди(Сообщение) Экспорт
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Сообщение", Сообщение);
	
	гкс_ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, 
		"гкс_ОчередьОбработкиВходящихСообщенийRMQ");
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаСообщенийОчереди(ПараметрыЗапроса)
	
	Перем РазмерПорции;
	Перем ПотокСобытий;
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		
		ПараметрыЗапроса.Свойство("РазмерПорции", РазмерПорции);
		ПараметрыЗапроса.Свойство("ПотокСобытий", ПотокСобытий);
		
		Если ЗначениеЗаполнено(ПотокСобытий) Тогда
			ТекстЗапроса = ТекстЗапросаСообщенийОчередиСОтборомПоПотокам();
		Иначе
			ТекстЗапроса = ТекстЗапросаСообщенийОчередиБезОтбораПоПотокам();
		КонецЕсли;
	
		Если ЗначениеЗаполнено(РазмерПорции) Тогда
			ТекстЗаменаПервые = "ВЫБРАТЬ ПЕРВЫЕ " + Формат(РазмерПорции, "ЧГ="); 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ ПЕРВЫЕ 100", ТекстЗаменаПервые);
		КонецЕсли;
		
	Иначе
		ТекстЗапроса = ТекстЗапросаСообщенийОчередиБезОтбораПоПотокам();
	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаПотокСобытийСообщения()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Очередь.ПотокСобытий
	|ИЗ
	|	РегистрСведений.гкс_ОчередьОбработкиВходящихСообщенийRMQ КАК Очередь
	|ГДЕ
	|	Очередь.Сообщение = &Сообщение";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСообщенийОчередиБезОтбораПоПотокам()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	Очередь.Порядок КАК Порядок,
	|	Очередь.Сообщение КАК Сообщение,
	|	Очередь.КлючОбъекта КАК КлючОбъекта,
	|	ЕСТЬNULL(ВходящиеСообщения.Содержимое, Неопределено) КАК Содержимое,
	|	ЕСТЬNULL(ВходящиеСообщения.КлючМаршрутизации, Неопределено) КАК КлючМаршрутизации
	|ИЗ
	|	РегистрСведений.гкс_ОчередьОбработкиВходящихСообщенийRMQ КАК Очередь
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ВходящиеСообщенияRMQ  КАК ВходящиеСообщения
	|		ПО Очередь.Сообщение = ВходящиеСообщения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСообщенийОчередиСОтборомПоПотокам()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	Очередь.Порядок КАК Порядок,
	|	Очередь.Сообщение КАК Сообщение,
	|	Очередь.КлючОбъекта КАК КлючОбъекта,
	|	ЕСТЬNULL(ВходящиеСообщения.Содержимое, Неопределено) КАК Содержимое,
	|	ЕСТЬNULL(ВходящиеСообщения.КлючМаршрутизации, Неопределено) КАК КлючМаршрутизации
	|ИЗ
	|	РегистрСведений.гкс_ОчередьОбработкиВходящихСообщенийRMQ КАК Очередь
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ВходящиеСообщенияRMQ  КАК ВходящиеСообщения
	|		ПО Очередь.Сообщение = ВходящиеСообщения.Ссылка
	|ГДЕ
	|	Очередь.ПотокСобытий = &ПотокСобытий
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
